Revit 2026 API

# PointCloudInstanceGetSelectionFilter Method

---

Returns the currently active selection filter for this point cloud.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointCloudFilter GetSelectionFilter()
```
```vb
Public Function GetSelectionFilter As PointCloudFilter
```
```cpp
public:
PointCloudFilter^ GetSelectionFilter()
```
```fsharp
member GetSelectionFilter : unit -> PointCloudFilter
```

#### Return Value

PointCloudFilter Currently active selection filter or  if none is active.

#### Reference

PointCloudInstance Class

Autodesk.Revit.DB Namespace